app/controllers/expedientes_controller.rb

	def show
		@codigoExpediente = params[:id]
		p @codigoExpediente
		unless @codigoExpediente.blank?
		  @codigo = Nino.encontrarCodigoPorExpediente(@codigoExpediente)
		  @nino = Nino.find_by_codigo(@codigo)
---
SELECT `expedientes`.* FROM `expedientes` WHERE (`expedientes`.`codigo` = 'EXP00035') LIMIT 1
SELECT `ninos`.* FROM `ninos` WHERE (`ninos`.`codigo` = '12008935') LIMIT 1