app/controllers/formularios_controller.rb

	def ninoform
		@educador = Educador.all
		@centros = Centro.all
---
SELECT `educadors`.* FROM `educadors`
SELECT `centros`.* FROM `centros`

	def padrinos
		@padrinos = Padrino.all
---
SELECT `padrinos`.* FROM `padrinos`

	def programas
		@programas = Programa.all
---
SELECT `programas`.* FROM `programas`

	def savePrograma
		Programa.insertar params
		@programas = Programa.all
---
SELECT `programas`.* FROM `programas`

	def savePadrino
		Padrino.insertar params
		@padrinos = Padrino.all
---
SELECT `padrinos`.* FROM `padrinos`

	def educaform
		@educador = Educador.all
---
SELECT `educadors`.* FROM `educadors`

	def centroform
	@centros = Centro.all
---
SELECT `centros`.* FROM `centros`