app/controllers/listados_controller.rb

SELECT `educadors`.* FROM `educadors`
SELECT `centros`.* FROM `centros`
SELECT `ninos`.* FROM `ninos`
---
	def index
		@educador = Educador.all
		@centros = Centro.all
		@ninos = Nino.all

SELECT `educadors`.* FROM `educadors`
SELECT `centros`.* FROM `centros`
---
	def educador
		@educador = Educador.all
		@centro = Centro.all

SELECT `padrinos`.* FROM `padrinos`
---
	def padrino
		@padrinos = Padrino.all