app/controllers/listados_controller.rb

	def busqueda
	  p params
		@educador = Educador.all
		@centros = Centro.all
---
SELECT `educadors`.* FROM `educadors`
SELECT `centros`.* FROM `centros`