app/controllers/ninos_controller.rb

SELECT `ninos`.* FROM `ninos`
---
	def index
		@ninos = Nino.all

SELECT `expedientes`.* FROM `expedientes` WHERE (`expedientes`.`codigo` = 'EXP00034') LIMIT 1
SELECT `ninos`.* FROM `ninos` WHERE (`ninos`.`codigo` = '002') LIMIT 1
---
	def expediente
		@codigoExpediente = params[:id]
		p @codigoExpediente
		unless @codigoExpediente.blank?
		  @codigo = Nino.encontrarCodigoPorExpediente(@codigoExpediente)
		  @nino = Nino.find_by_codigo(@codigo)

SELECT `ninos`.* FROM `ninos` WHERE (`ninos`.`codigo` = '128901') LIMIT 1
---
	def show
		codigo = params[:id]
		@nino = Nino.find_by_codigo(codigo)